A3_BOUNDARIES = {'LEN_X_НИЖНЯЯ_ГРАНИЦА': 210,
                 'LEN_Y_ЛЕВАЯ_ГРАНИЦА': 287,
                 'LEN_X_ВЕРХНЯЯ_ГРАНИЦА': 395,
                 'LEN_Y_ПРАВАЯ_ГРАНИЦА': 232,
                 'LEN_TOP_HEADER':14}

A2_BOUNDARIES = {'LEN_X_НИЖНЯЯ_ГРАНИЦА': 384,
                 'LEN_Y_НИЖНЯЯ_ГРАНИЦА': 410,
                 'LEN_X_ВЕРХНЯЯ_ГРАНИЦА': 569,
                 'LEN_Y_ВЕРХНЯЯ_ГРАНИЦА': 355}

A1_BOUNDARIES = {'LEN_X_НИЖНЯЯ_ГРАНИЦА': 631,
                 'LEN_Y_НИЖНЯЯ_ГРАНИЦА': 584,
                 'LEN_X_ВЕРХНЯЯ_ГРАНИЦА': 816,
                 'LEN_Y_ВЕРХНЯЯ_ГРАНИЦА': 529}

